# DefinitionGroups Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
DefinitionGroups Properties
DefinitionGroups Class See Also
---
The DefinitionGroups type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsEmpty | Identifies if the definition groups collection is empty. |
| Item | Retrieve a definition group by name. |
| Size | The number of definition groups in the collection. |

# See Also
DefinitionGroups Class
Autodesk.Revit.DB Namespace